base/Catalogs/бит_УдалитьХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_УдалитьХозяйственныеОперации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Enums/бит_ВидыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовСистемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>План счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>План видов характеристик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Comment>Регистр накопления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Comment>Бизнес процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_УдалитьХозяйственныеОперации/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКэшированныеЗначения(мКэшЗначений);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Объект.Наименование = Элемент.ТекстРедактирования;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСистемыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВидовОбъектов = Новый СписокЗначений;
	СписокВидовОбъектов.Добавить(мКэшЗначений.ВидОбъектаДокумент);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидыОбъектов",				СписокВидовОбъектов);
	ПараметрыФормы.Вставить("ТекущийОбъектСистемы",		мКэшЗначений.ОбъектСистемы);
	ПараметрыФормы.Вставить("ДоступныеОбъектыСистемы",	мКэшЗначений.ДоступныеОбъектыСистемы);
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы", ПараметрыФормы, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//  Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшированныеЗначения(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	КэшированныеЗначения.Вставить("ВидОбъектаДокумент" ,Перечисления.бит_ВидыОбъектовСистемы.Документ);

	ДоступныеОбъектыСистемы = Новый СписокЗначений;

	Если Метаданные.Документы.Найти("бит_кзн_ПлатежнаяПозиция") <> Неопределено Тогда 	
		// + Документ бит_кзн_ПлатежнаяПозиция
		ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Документы.бит_кзн_ПлатежнаяПозиция);
		ДоступныеОбъектыСистемы.Добавить(ОбъектСистемы);
	КонецЕсли;
	
	Если Метаданные.Документы.Найти("бит_кзн_ПозицияПоступления") <> Неопределено Тогда 	
		// + Документ бит_кзн_ПозицияПоступления
		ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Документы.бит_кзн_ПозицияПоступления);
		ДоступныеОбъектыСистемы.Добавить(ОбъектСистемы);
	КонецЕсли;
	
	Если Метаданные.Документы.Найти("бит_кзн_ЗаявкаНаРасходованиеСредств") <> Неопределено Тогда 	
		// + Документ бит_кзн_ПозицияПоступления
		ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Документы.бит_кзн_ЗаявкаНаРасходованиеСредств);
		ДоступныеОбъектыСистемы.Добавить(ОбъектСистемы);
	КонецЕсли;
	
	Если Метаданные.Документы.Найти("бит_кзн_ПланируемоеПоступлениеДенежныхСредств") <> Неопределено Тогда 	
		// + Документ бит_кзн_ПозицияПоступления
		ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств);
		ДоступныеОбъектыСистемы.Добавить(ОбъектСистемы);
	КонецЕсли;
	
	Если Метаданные.Документы.Найти("бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств") <> Неопределено Тогда 	
		// + Документ бит_кзн_ПозицияПоступления
		ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств);
		ДоступныеОбъектыСистемы.Добавить(ОбъектСистемы);
	КонецЕсли;
	
	КэшированныеЗначения.Вставить("ДоступныеОбъектыСистемы", ДоступныеОбъектыСистемы);	
	
	ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Документы.бит_кзн_ЗаявкаНаРасходованиеСредств);
	КэшированныеЗначения.Вставить("ОбъектСистемы", ОбъектСистемы);	
 
КонецПроцедуры

#КонецОбласти
